
#include "GUI_Port.h"
#include "GUI_Base.h"

/*******************************************************************************
**函	数: GUI_LCDDrier_Init()
**功	能: 液晶驱动初始化
**参	数: void
**返	回：void
**说    明：用户驱动提供接口
*******************************************************************************/
void GUI_LCDDrier_Init(void)
{
    LCD_Init();                         
}

/*******************************************************************************
**函	数: GUI_LCDDrier_WritePixel()
**功	能: 液晶驱动 写像素
**参	数: xpos    -- X轴坐标
            ypos    -- y轴坐标
            color   -- 颜色值
**返	回：void
**说    明：用户驱动提供接口
*******************************************************************************/
void GUI_LCDDrier_WritePixel(u16 xpos,u16 ypos,u16 color)
{
    POINT_COLOR = color;
    LCD_DrawPoint(xpos,ypos);           //驱动提供接口
}

/*******************************************************************************
**函	数: GUI_LCDDrier_Init()
**功	能: 液晶驱动 读像素
**参	数: xpos    -- X轴坐标
            ypos    -- y轴坐标
**返	回：读取的颜色值
**说    明：用户驱动提供接口
*******************************************************************************/
u16 GUI_LCDDrier_ReadPixel(u16 xpos,u16 ypos)
{
    u16 color = 0;
    color = LCD_ReadPoint(xpos,ypos);
    return color;
}

